lkolbly/cmsis-svd/data/TexasInstruments/LM3S5D51.svd
        <register>
          <name>SSOP3</name>
          <description>ADC Sample Sequence 3 Operation</description>
          <addressOffset>0x000000B0</addressOffset>
          <fields>
            <field>
              <name>ADC_SSOP3_S0DCOP</name>
              <description>Sample 0 Digital Comparator Operation</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSDC3</name>
          <description>ADC Sample Sequence 3 Digital Comparator Select</description>
          <addressOffset>0x000000B4</addressOffset>
          <fields>
            <field>
              <name>ADC_SSDC3_S0DCSEL</name>
              <description>Sample 0 Digital Comparator Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRIC</name>
          <description>ADC Digital Comparator Reset Initial Conditions</description>
          <addressOffset>0x00000D00</addressOffset>
          <fields>
            <field>
              <name>ADC_DCRIC_DCINT0</name>
              <description>Digital Comparator Interrupt 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT1</name>
              <description>Digital Comparator Interrupt 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT2</name>
              <description>Digital Comparator Interrupt 2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT3</name>
              <description>Digital Comparator Interrupt 3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT4</name>
              <description>Digital Comparator Interrupt 4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT5</name>
              <description>Digital Comparator Interrupt 5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT6</name>
              <description>Digital Comparator Interrupt 6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCINT7</name>
              <description>Digital Comparator Interrupt 7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG0</name>
              <description>Digital Comparator Trigger 0</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG1</name>
              <description>Digital Comparator Trigger 1</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG2</name>
              <description>Digital Comparator Trigger 2</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG3</name>
              <description>Digital Comparator Trigger 3</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG4</name>
              <description>Digital Comparator Trigger 4</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG5</name>
              <description>Digital Comparator Trigger 5</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG6</name>
              <description>Digital Comparator Trigger 6</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADC_DCRIC_DCTRIG7</name>
              <description>Digital Comparator Trigger 7</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL0</name>
          <description>ADC Digital Comparator Control 0</description>
          <addressOffset>0x00000E00</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL0_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCCTL0_CTM</name>
              <description>Comparison Trigger Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CTC</name>
              <description>Comparison Trigger Condition</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL0_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL0_CTE</name>
              <description>Comparison Trigger Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL1</name>
          <description>ADC Digital Comparator Control 1</description>
          <addressOffset>0x00000E04</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL1_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCCTL1_CTM</name>
              <description>Comparison Trigger Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CTC</name>
              <description>Comparison Trigger Condition</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL1_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL1_CTE</name>
              <description>Comparison Trigger Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL2</name>
          <description>ADC Digital Comparator Control 2</description>
          <addressOffset>0x00000E08</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL2_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCCTL2_CTM</name>
              <description>Comparison Trigger Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CTC</name>
              <description>Comparison Trigger Condition</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CTE</name>
              <description>Comparison Trigger Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL3</name>
          <description>ADC Digital Comparator Control 3</description>
          <addressOffset>0x00000E0C</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL3_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC_DCCTL3_CTM</name>
              <description>Comparison Trigger Mode</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CTC</name>
              <description>Comparison Trigger Condition</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CTC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CTE</name>
              <description>Comparison Trigger Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
